/* Error description */
"A component of the path is not a directory." = "A component of the path is not a directory.";

/* Error description */
"Buffer too small for attribute names." = "Buffer too small for attribute names.";

/* Error description */
"Failed to reassemble attribute value." = "Failed to reassemble attribute value.";

/* Error description */
"File name too long." = "File name too long.";

/* Error description */
"File system does not support extended attributes or they are disabled." = "File system does not support extended attributes or they are disabled.";

/* Error description */
"I/O error occurred." = "I/O error occurred.";

/* Error description */
"No space left on file system." = "No space left on file system.";

/* Error description */
"Options contained XATTR_CREATE but the named attribute exists." = "Options contained XATTR_CREATE but the named attribute exists.";

/* Error description */
"Options not recognized." = "Options not recognized.";

/* Error description */
"Path or name points to an invalid address." = "Path or name points to an invalid address.";

/* Error description */
"Read-only file system.  Unable to change attributes." = "Read-only file system.  Unable to change attributes.";

/* Error description */
"Search permission denied for this path." = "Search permission denied for this path.";

/* Error description */
"The data size of the extended attribute is too large." = "The data size of the extended attribute is too large.";

/* Error description */
"The file does not exist or is not a file." = "The file does not exist or is not a file.";

/* Error description */
"The file does not exist or is not a package." = "The file does not exist or is not a package.";

/* Error description */
"The named attribute does not exist." = "The named attribute does not exist.";

/* Error description */
"This file system object does not support extended attributes." = "This file system object does not support extended attributes.";

/* Error description */
"Too many symlinks encountered resolving path." = "Too many symlinks encountered resolving path.";

/* Error description */
"Unknown error occurred." = "Unknown error occurred.";

